{
  "title": "New York drops plan to legalize robotaxis in setback for Waymo",
  "slug": "new-york-drops-plan-to-legalize-robotaxis-in-setback-for-waymo",
  "date": "2026-02-19T16:53:05.000Z",
  "description": "A Waymo autonomous self-driving Jaguar electric vehicle is seen in the Manhattan borough of New York City, on December 13, 2025. (Photo by CHARLY TRIBALLEAU / A",
  "category": "Tech",
  "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/gettyimages-2251073584.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100",
  "content": {
    "summary": "A Waymo autonomous self-driving Jaguar electric vehicle is seen in the Manhattan borough of New York City, on December 13, 2025. (Photo by CHARLY TRIBALLEAU / AFP via Getty Images) | AFP via Getty Images New York Governor Kathy Hochul (D) dropped her proposal to allow robotaxi companies to launch commercially in cities other than New York City, citing a lack of support among state legislators, Bloomberg reports today. The move is a blow to Waymo and other robotaxi companies who saw New York, and especially New York City, as a potential goldmine. The plan, which was introduced by Hochul as part of the state's budget proposal last month, would have allowed limited robotaxi deployment in cities other than the Big Apple - while leaving whether New York City would get autonomous vehicles up to the mayor and the City Council. But now that plan i … Read the full story at The Verge....",
    "impact": "The implications of this tech update are significant for digital infrastructure in Tier-1 nations. Experts suggest that such developments could influence both consumer behavior and enterprise-level security protocols in the US, UK, CA, and AU markets.",
    "takeaways": [
      "Analyze how this Tech shift affects your current digital setup.",
      "Stay proactive by implementing recommended security patches or software updates.",
      "Monitor News Era for further developments on this story."
    ]
  },
  "link": "https://www.theverge.com/transportation/881354/new-york-drops-plan-to-legalize-robotaxis-waymo",
  "author": "News Era Team"
}