{
  "title": "Turtle Beach’s new PC controller with swiveling sticks is 30 percent off",
  "slug": "turtle-beachs-new-pc-controller-with-swiveling-sticks-is-30-percent-off",
  "date": "2026-02-19T16:42:06.000Z",
  "description": "Many modern gamepads have adopted a modular design in recent years, from the Victrix Pro BFG Reloaded to Hyperkin’s clamp-on X5 Alteron for the Nintendo Switch.",
  "category": "Tech",
  "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/Turtle-Beach-Stealth-Pivot-Deal-Image-2.png?quality=90&#038;strip=all&#038;crop=0,0,100,100",
  "content": {
    "summary": "Many modern gamepads have adopted a modular design in recent years, from the Victrix Pro BFG Reloaded to Hyperkin’s clamp-on X5 Alteron for the Nintendo Switch. However, few of them are quite as innovative as last year’s Turtle Beach Stealth Pivot, which is now on sale at Amazon and Best Buy for an all-time low of $99.99 ($40 off). Turtle Beach Stealth Pivot Where to Buy: $139.99 $99.99 at Amazon $139.99 $99.99 at Best Buy $139.99 at Turtle Beach The defining feature of the Stealth Pivot doesn’t lie with its drift-free Hall effects sticks or its built-in social notifications — though, those are nice additions. The controller’s main selling factor is a pair of rotating modules, which, when depressed and swiveled, turn an otherwise traditional button and thumbstick layout into one better fit for tackling retro titles and fighting games. You also get a set of programmable back buttons, adjustable trigger stops for a more customized feel, a 3.5mm jack, and the ability to save up to five di...",
    "impact": "The implications of this tech update are significant for digital infrastructure in Tier-1 nations. Experts suggest that such developments could influence both consumer behavior and enterprise-level security protocols in the US, UK, CA, and AU markets.",
    "takeaways": [
      "Analyze how this Tech shift affects your current digital setup.",
      "Stay proactive by implementing recommended security patches or software updates.",
      "Monitor News Era for further developments on this story."
    ]
  },
  "link": "https://www.theverge.com/gadgets/881030/turtle-beach-stealth-pivot-controller-lego-mario-yoshi-deal-sale",
  "author": "News Era Team"
}